## Dia 6

- calcular a quantidade de empréstimos realizados entre 2015 e 2020 por cada curso de graduação que passará pela avaliação.
- Cursos a serem avaliados:
    * Biblioteconomia
    * Ciências sociais
    * Comunicação social
    * Direito
    * Filosofia
    * Pedagogia
- Formato da tabela

Gerar uma tabela com as seguintes características:

Índice: Cursos
Colunas: Ano
Valores: Quantidade de empréstimos
Total: Acrescente uma linha e uma coluna de total a tabela

| Índice | Ano | Total |
|----------|----------|----------|
| Cursos | qtd de empréstimo  | Total de emprestimos  |

In [43]:
# imports

import pandas as pd
import json

In [44]:
# lendo os dados de matrículas dos alunos
# necessário ter biblioteca openpyxl instalada: pip install openpyxl

data_xls_before_2010 = pd.read_excel('../datasets/dados_alunos/matricula_alunos.xlsx',engine='openpyxl', sheet_name='Até 2010')
data_xls_before_2010

,Matricula de alunos até 2010,Unnamed: 1,Unnamed: 2
0,Número da matrícula,Tipo de vinculo,Curso
1,190001688.0,ALUNO DE GRADUAÇÃO,MATEMÁTICA
2,199014489.0,ALUNO DE GRADUAÇÃO,CIÊNCIAS BIOLÓGICAS
3,199735674.0,ALUNO DE GRADUAÇÃO,MATEMÁTICA
4,199812431.0,ALUNO DE GRADUAÇÃO,LETRAS
...,...,...,...
7722,2009075211.0,ALUNO DE GRADUAÇÃO,BIBLIOTECONOMIA
7723,2009075249.0,ALUNO DE GRADUAÇÃO,ANÁLISE E DESENVOLVIMENTO DE SISTEMAS
7724,2009075294.0,ALUNO DE GRADUAÇÃO,ADMINISTRAÇÃO
7725,2009075300.0,ALUNO DE GRADUAÇÃO,MÚSICA
7726,2009075329.0,ALUNO DE GRADUAÇÃO,DIREITO

In [45]:
data_xls_after_2010 = pd.read_excel('../datasets/dados_alunos/matricula_alunos.xlsx',engine='openpyxl', sheet_name='Após 2010')
data_xls_after_2010

,Matricula de alunos após 2010,Unnamed: 1,Unnamed: 2
0,Matricula,Tipo de vinculo,Cursos
1,2010000017.0,ALUNO DE GRADUAÇÃO,DIREITO
2,2010000035.0,ALUNO DE GRADUAÇÃO,AGRONOMIA
3,2010001290.0,ALUNO DE GRADUAÇÃO,ENGENHARIA QUÍMICA
4,2010002849.0,ALUNO DE GRADUAÇÃO,ENGENHARIA AMBIENTAL
...,...,...,...
2270,20150116770.0,ALUNO DE GRADUAÇÃO,LETRAS
2271,2015074523.0,ALUNO DE GRADUAÇÃO,DANÇA
2272,20160002745.0,ALUNO DE GRADUAÇÃO,ENGENHARIA DA COMPUTAÇÃO
2273,20170086533.0,ALUNO DE GRADUAÇÃO,BIBLIOTECONOMIA
2274,20180090351.0,ALUNO DE GRADUAÇÃO,DANÇA

In [46]:
# limpando o cabeçalho duplicado da tabela data_xls_before_2010

data_xls_before_2010 = data_xls_before_2010[1:]
data_xls_before_2010.columns = ['matricula', 'vinculo','curso']

In [47]:
data_xls_before_2010

         matricula             vinculo                                  curso
1      190001688.0  ALUNO DE GRADUAÇÃO                             MATEMÁTICA
2      199014489.0  ALUNO DE GRADUAÇÃO                    CIÊNCIAS BIOLÓGICAS
3      199735674.0  ALUNO DE GRADUAÇÃO                             MATEMÁTICA
4      199812431.0  ALUNO DE GRADUAÇÃO                                 LETRAS
5      199823670.0  ALUNO DE GRADUAÇÃO                               ECOLOGIA
...            ...                 ...                                    ...
7722  2009075211.0  ALUNO DE GRADUAÇÃO                        BIBLIOTECONOMIA
7723  2009075249.0  ALUNO DE GRADUAÇÃO  ANÁLISE E DESENVOLVIMENTO DE SISTEMAS
7724  2009075294.0  ALUNO DE GRADUAÇÃO                          ADMINISTRAÇÃO
7725  2009075300.0  ALUNO DE GRADUAÇÃO                                 MÚSICA
7726  2009075329.0  ALUNO DE GRADUAÇÃO                                DIREITO

[7726 rows x 3 columns]

In [48]:
# limpando o cabeçalho duplicado da tabela data_xls_after_2010

data_xls_after_2010 = data_xls_after_2010[1:]
data_xls_after_2010.columns = ['matricula', 'vinculo','curso']

In [49]:
data_xls_after_2010

          matricula             vinculo                     curso
1      2010000017.0  ALUNO DE GRADUAÇÃO                   DIREITO
2      2010000035.0  ALUNO DE GRADUAÇÃO                 AGRONOMIA
3      2010001290.0  ALUNO DE GRADUAÇÃO        ENGENHARIA QUÍMICA
4      2010002849.0  ALUNO DE GRADUAÇÃO      ENGENHARIA AMBIENTAL
5      2010003381.0  ALUNO DE GRADUAÇÃO                 GEOGRAFIA
...             ...                 ...                       ...
2270  20150116770.0  ALUNO DE GRADUAÇÃO                    LETRAS
2271   2015074523.0  ALUNO DE GRADUAÇÃO                     DANÇA
2272  20160002745.0  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
2273  20170086533.0  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
2274  20180090351.0  ALUNO DE GRADUAÇÃO                     DANÇA

[2274 rows x 3 columns]

In [50]:
# unindo os dataframes xls em um único dataframe

data_xls = pd.concat([data_xls_before_2010, data_xls_after_2010], ignore_index=True)
data_xls

          matricula             vinculo                     curso
0       190001688.0  ALUNO DE GRADUAÇÃO                MATEMÁTICA
1       199014489.0  ALUNO DE GRADUAÇÃO       CIÊNCIAS BIOLÓGICAS
2       199735674.0  ALUNO DE GRADUAÇÃO                MATEMÁTICA
3       199812431.0  ALUNO DE GRADUAÇÃO                    LETRAS
4       199823670.0  ALUNO DE GRADUAÇÃO                  ECOLOGIA
...             ...                 ...                       ...
9995  20150116770.0  ALUNO DE GRADUAÇÃO                    LETRAS
9996   2015074523.0  ALUNO DE GRADUAÇÃO                     DANÇA
9997  20160002745.0  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
9998  20170086533.0  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
9999  20180090351.0  ALUNO DE GRADUAÇÃO                     DANÇA

[10000 rows x 3 columns]

In [51]:
data_xls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   matricula  10000 non-null  object
 1   vinculo    10000 non-null  object
 2   curso      10000 non-null  object
dtypes: object(3)
memory usage: 234.5+ KB

In [52]:
# eliminando o ponto flutuante da coluna matricula

data_xls.loc[:,'matricula'] = data_xls['matricula'].str.replace('.0','')  
data_xls

        matricula             vinculo                     curso
0       190001688  ALUNO DE GRADUAÇÃO                MATEMÁTICA
1       199014489  ALUNO DE GRADUAÇÃO       CIÊNCIAS BIOLÓGICAS
2       199735674  ALUNO DE GRADUAÇÃO                MATEMÁTICA
3       199812431  ALUNO DE GRADUAÇÃO                    LETRAS
4       199823670  ALUNO DE GRADUAÇÃO                  ECOLOGIA
...           ...                 ...                       ...
9995  20150116770  ALUNO DE GRADUAÇÃO                    LETRAS
9996   2015074523  ALUNO DE GRADUAÇÃO                     DANÇA
9997  20160002745  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
9998  20170086533  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
9999  20180090351  ALUNO DE GRADUAÇÃO                     DANÇA

[10000 rows x 3 columns]

In [53]:
# selecionando os dados apenas dos alunos de graduação

data_xls_grad = data_xls[data_xls['vinculo']=='ALUNO DE GRADUAÇÃO']
data_xls_grad

        matricula             vinculo                     curso
0       190001688  ALUNO DE GRADUAÇÃO                MATEMÁTICA
1       199014489  ALUNO DE GRADUAÇÃO       CIÊNCIAS BIOLÓGICAS
2       199735674  ALUNO DE GRADUAÇÃO                MATEMÁTICA
3       199812431  ALUNO DE GRADUAÇÃO                    LETRAS
4       199823670  ALUNO DE GRADUAÇÃO                  ECOLOGIA
...           ...                 ...                       ...
9995  20150116770  ALUNO DE GRADUAÇÃO                    LETRAS
9996   2015074523  ALUNO DE GRADUAÇÃO                     DANÇA
9997  20160002745  ALUNO DE GRADUAÇÃO  ENGENHARIA DA COMPUTAÇÃO
9998  20170086533  ALUNO DE GRADUAÇÃO           BIBLIOTECONOMIA
9999  20180090351  ALUNO DE GRADUAÇÃO                     DANÇA

[10000 rows x 3 columns]

In [54]:
# Verificando se existem dados faltantes

data_xls.isnull().sum()

matricula    0
vinculo      0
curso        0
dtype: int64

In [55]:
# verificando se existem dados duplicados

data_xls.duplicated().sum()

np.int64(0)

In [56]:
# Lendo os dados do arquivo JSON


data_json = pd.read_json('../datasets/dados_alunos/matricula_alunos2.json')
data_json.head()

     tipo_curso                                          registros
0     GRADUACAO  [{"matricula_ou_siape": "2009029003.0", "tipo_...
1  POSGRADUACAO  [{"matricula_ou_siape": "2008112114.0", "tipo_...

In [57]:
# Parseando a variável string JSON  para DataFrame

stundents_grad = data_json['registros'][0]
df_data_json_grad = pd.json_normalize(json.loads(stundents_grad)) # 
df_data_json_grad

      matricula_ou_siape tipo_vinculo_usuario                   curso
0           2009029003.0   ALUNO DE GRADUAÇÃO               FILOSOFIA
1            200617346.0   ALUNO DE GRADUAÇÃO                 DIREITO
2            200746502.0   ALUNO DE GRADUAÇÃO  ENGENHARIA DE PETRÓLEO
3            200504968.0   ALUNO DE GRADUAÇÃO           ADMINISTRAÇÃO
4            200615572.0   ALUNO DE GRADUAÇÃO   CIÊNCIA DA COMPUTAÇÃO
...                  ...                  ...                     ...
62797      20200012706.0   ALUNO DE GRADUAÇÃO         BIBLIOTECONOMIA
62798      20200039601.0   ALUNO DE GRADUAÇÃO    ENGENHARIA FLORESTAL
62799      20200132517.0   ALUNO DE GRADUAÇÃO               AGRONOMIA
62800      20200009344.0   ALUNO DE GRADUAÇÃO         BIBLIOTECONOMIA
62801      20200090284.0   ALUNO DE GRADUAÇÃO                 DIREITO

[62802 rows x 3 columns]

In [58]:
# analisando os dados do DataFrame

df_data_json_grad.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62802 entries, 0 to 62801
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   matricula_ou_siape    62802 non-null  object
 1   tipo_vinculo_usuario  62802 non-null  object
 2   curso                 62802 non-null  object
dtypes: object(3)
memory usage: 1.4+ MB

In [59]:
# eliminando o ponto flutuante da coluna matricula

df_data_json_grad.loc[:,'matricula_ou_siape'] = df_data_json_grad['matricula_ou_siape'].str.replace('.0','')
df_data_json_grad

      matricula_ou_siape tipo_vinculo_usuario                   curso
0             2009029003   ALUNO DE GRADUAÇÃO               FILOSOFIA
1              200617346   ALUNO DE GRADUAÇÃO                 DIREITO
2              200746502   ALUNO DE GRADUAÇÃO  ENGENHARIA DE PETRÓLEO
3              200504968   ALUNO DE GRADUAÇÃO           ADMINISTRAÇÃO
4              200615572   ALUNO DE GRADUAÇÃO   CIÊNCIA DA COMPUTAÇÃO
...                  ...                  ...                     ...
62797        20200012706   ALUNO DE GRADUAÇÃO         BIBLIOTECONOMIA
62798        20200039601   ALUNO DE GRADUAÇÃO    ENGENHARIA FLORESTAL
62799        20200132517   ALUNO DE GRADUAÇÃO               AGRONOMIA
62800        20200009344   ALUNO DE GRADUAÇÃO         BIBLIOTECONOMIA
62801        20200090284   ALUNO DE GRADUAÇÃO                 DIREITO

[62802 rows x 3 columns]

In [60]:
# unindo os dois DataFrames
data_xls_grad.columns = ['matricula_ou_siape', 'vinculo', 'curso']
df_data_json_grad.columns = data_xls_grad.columns

df_all = pd.concat([data_xls_grad, df_data_json_grad], ignore_index=True)
df_all

      matricula_ou_siape             vinculo                 curso
0              190001688  ALUNO DE GRADUAÇÃO            MATEMÁTICA
1              199014489  ALUNO DE GRADUAÇÃO   CIÊNCIAS BIOLÓGICAS
2              199735674  ALUNO DE GRADUAÇÃO            MATEMÁTICA
3              199812431  ALUNO DE GRADUAÇÃO                LETRAS
4              199823670  ALUNO DE GRADUAÇÃO              ECOLOGIA
...                  ...                 ...                   ...
72797        20200012706  ALUNO DE GRADUAÇÃO       BIBLIOTECONOMIA
72798        20200039601  ALUNO DE GRADUAÇÃO  ENGENHARIA FLORESTAL
72799        20200132517  ALUNO DE GRADUAÇÃO             AGRONOMIA
72800        20200009344  ALUNO DE GRADUAÇÃO       BIBLIOTECONOMIA
72801        20200090284  ALUNO DE GRADUAÇÃO               DIREITO

[72802 rows x 3 columns]

In [61]:
# verificando se tem dados duplicados no DataFrame final
df_all.duplicated().sum()

np.int64(0)

In [62]:
# verificando dados faltantes no DataFrame unido
df_all.isnull().sum()

matricula_ou_siape    0
vinculo               0
curso                 0
dtype: int64

In [63]:
# verificando os cursos da base de dados unida
df_all['curso'].value_counts()

curso
AGRONOMIA                                3417
MATEMÁTICA                               3330
COMUNICAÇÃO SOCIAL                       3326
CIÊNCIAS BIOLÓGICAS                      3306
BIBLIOTECONOMIA                          3282
CIÊNCIAS SOCIAIS                         3279
CIÊNCIA DA COMPUTAÇÃO                    3273
DANÇA                                    3263
SISTEMAS DE INFORMAÇÃO                   3237
ADMINISTRAÇÃO                            3226
DIREITO                                  3225
CIÊNCIAS E TECNOLOGIA                    2938
CIÊNCIAS ATUARIAIS                       2921
ENGENHARIA DE PETRÓLEO                   2908
FILOSOFIA                                2874
EDUCAÇÃO FÍSICA                          2867
ENGENHARIA FLORESTAL                     2867
ENFERMAGEM                               2855
PEDAGOGIA                                2847
ARQUITETURA E URBANISMO                  2837
BIOMEDICINA                              2806
ENGENHARIA CIVIL                         2791
ENGENHARIA QUÍMICA                        475
ECOLOGIA                                  464
FISIOTERAPIA                              454
GEOGRAFIA                                 445
NUTRIÇÃO                                  438
ENGENHARIA DA COMPUTAÇÃO                  438
ANÁLISE E DESENVOLVIMENTO DE SISTEMAS     435
MÚSICA                                    427
TURISMO                                   416
ENGENHARIA AMBIENTAL                      393
LETRAS                                    388
HISTÓRIA                                  354
Name: count, dtype: int64

In [64]:
# lendo os dados de empréstimos de exemplares

df_data_loans = pd.read_parquet('../datasets/dados_tratados/dados_emprestimos_tratados.parquet')
df_data_loans.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas
1,9405492,2010040100,2017-01-31 07:31:36.902,2017-01-02 08:29:46.722,2017-02-21 13:16:33,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1051275,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,651,Ciências aplicadas
2,9405496,2013105705,2017-01-31 07:31:36.843,2017-01-02 08:29:46.794,2017-02-21 13:15:46,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1097159,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,380,Ciências sociais
3,9405504,H004983,2017-01-31 07:31:36.786,2017-01-02 08:46:42.991,2017-02-22 16:10:28,20161011168,ALUNO DE PÓS-GRADUAÇÃO,132715,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,635,Ciências aplicadas
4,9405508,H011333,2017-01-31 07:31:36.658,2017-01-02 08:46:43.400,2017-02-22 16:10:40,20161011168,ALUNO DE PÓS-GRADUAÇÃO,180475,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,632,Ciências aplicadas

In [65]:
# unindo os dados de alunos com os dados de empréstimos

df_merged = pd.merge(df_data_loans, df_all, how='left', left_on='matricula_ou_siape', right_on='matricula_ou_siape')
df_merged.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu,vinculo,curso
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas,ALUNO DE GRADUAÇÃO,ENGENHARIA CIVIL
1,9405492,2010040100,2017-01-31 07:31:36.902,2017-01-02 08:29:46.722,2017-02-21 13:16:33,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1051275,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,651,Ciências aplicadas,NaN,NaN
2,9405496,2013105705,2017-01-31 07:31:36.843,2017-01-02 08:29:46.794,2017-02-21 13:15:46,20161011168,ALUNO DE PÓS-GRADUAÇÃO,1097159,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,380,Ciências sociais,NaN,NaN
3,9405504,H004983,2017-01-31 07:31:36.786,2017-01-02 08:46:42.991,2017-02-22 16:10:28,20161011168,ALUNO DE PÓS-GRADUAÇÃO,132715,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,635,Ciências aplicadas,NaN,NaN
4,9405508,H011333,2017-01-31 07:31:36.658,2017-01-02 08:46:43.400,2017-02-22 16:10:40,20161011168,ALUNO DE PÓS-GRADUAÇÃO,180475,Acervo Circulante,Biblioteca Setorial do Centro de Ciências Huma...,REGULAR,632,Ciências aplicadas,NaN,NaN

In [66]:
# selecionando apenas os alunos de graduação

df_merged_grad = df_merged[df_merged['vinculo']=='ALUNO DE GRADUAÇÃO']
df_merged_grad.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu,vinculo,curso
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas,ALUNO DE GRADUAÇÃO,ENGENHARIA CIVIL
18,9405564,L195470,2017-01-17 16:03:38.760,2017-01-02 10:12:01.462,2017-01-27 16:37:55,2014036205,ALUNO DE GRADUAÇÃO,168135,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,679,Ciências aplicadas,ALUNO DE GRADUAÇÃO,BIOMEDICINA
19,9405568,2015008037,2017-01-17 16:03:38.705,2017-01-02 10:12:01.529,2017-01-27 16:37:59,2014036205,ALUNO DE GRADUAÇÃO,1179312,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,566,Matemática e ciências naturais,ALUNO DE GRADUAÇÃO,BIOMEDICINA
26,9405596,2009041801,NaT,2017-01-02 10:21:42.118,2017-01-24 12:16:56,2013042932,ALUNO DE GRADUAÇÃO,276766,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,634,Ciências aplicadas,ALUNO DE GRADUAÇÃO,CIÊNCIAS SOCIAIS
27,9405600,2009041801A,NaT,2017-01-02 10:21:42.162,2017-01-24 12:16:51,2013042932,ALUNO DE GRADUAÇÃO,276767,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,610,Ciências aplicadas,ALUNO DE GRADUAÇÃO,CIÊNCIAS SOCIAIS

In [67]:
# excluindo colunas desnecessárias
df_merged_grad = df_merged_grad.drop(columns=['vinculo'])
df_merged_grad.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu,curso
0,9405484,2011010806,2017-01-13 07:22:40.736,2017-01-02 08:01:14.113,2017-01-30 07:05:05,2014035816,ALUNO DE GRADUAÇÃO,915480,Acervo Circulante,Biblioteca Setorial Profª. Maria José Mamede G...,REGULAR,689,Ciências aplicadas,ENGENHARIA CIVIL
18,9405564,L195470,2017-01-17 16:03:38.760,2017-01-02 10:12:01.462,2017-01-27 16:37:55,2014036205,ALUNO DE GRADUAÇÃO,168135,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,679,Ciências aplicadas,BIOMEDICINA
19,9405568,2015008037,2017-01-17 16:03:38.705,2017-01-02 10:12:01.529,2017-01-27 16:37:59,2014036205,ALUNO DE GRADUAÇÃO,1179312,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,566,Matemática e ciências naturais,BIOMEDICINA
26,9405596,2009041801,NaT,2017-01-02 10:21:42.118,2017-01-24 12:16:56,2013042932,ALUNO DE GRADUAÇÃO,276766,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,634,Ciências aplicadas,CIÊNCIAS SOCIAIS
27,9405600,2009041801A,NaT,2017-01-02 10:21:42.162,2017-01-24 12:16:51,2013042932,ALUNO DE GRADUAÇÃO,276767,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,610,Ciências aplicadas,CIÊNCIAS SOCIAIS

In [68]:
# vericando os dados faltantes no DataFrame final
df_merged_grad.isnull().sum()

id_emprestimo                0
codigo_barras                0
data_renovacao          884899
data_emprestimo              0
data_devolucao            4741
matricula_ou_siape           0
tipo_vinculo_usuario         0
id_exemplar                  0
colecao                      0
biblioteca                   0
status_material              0
localizacao                  0
classificacao_cdu            0
curso                        0
dtype: int64

In [69]:
# verificando dados duplicados no DataFrame final
df_merged_grad.duplicated().sum()

np.int64(0)

In [70]:
# transformando a coluna da data para ano de empréstimo
df_merged_grad['data_emprestimo'] = pd.to_datetime(df_merged_grad['data_emprestimo']).dt.year

In [71]:
# selecionando os empréstimos apenas dos cursos avaliados no período 2015 e 2020

df_merged_grad = df_merged_grad.query("""curso == ['BIBLIOTECONOMIA', 'CIÊNCIAS SOCIAIS', 'COMUNICAÇÃO SOCIAL', 'DIREITO', 'FILOSOFIA', 'PEDAGOGIA'] & (data_emprestimo >= 2015) """)

df_merged_grad.head()

,id_emprestimo,codigo_barras,data_renovacao,data_emprestimo,data_devolucao,matricula_ou_siape,tipo_vinculo_usuario,id_exemplar,colecao,biblioteca,status_material,localizacao,classificacao_cdu,curso
26,9405596,2009041801,NaT,2017,2017-01-24 12:16:56,2013042932,ALUNO DE GRADUAÇÃO,276766,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,634,Ciências aplicadas,CIÊNCIAS SOCIAIS
27,9405600,2009041801A,NaT,2017,2017-01-24 12:16:51,2013042932,ALUNO DE GRADUAÇÃO,276767,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,610,Ciências aplicadas,CIÊNCIAS SOCIAIS
56,9405720,2013006266,2017-01-17 08:45:56.543,2017,2017-01-30 08:48:32,2012952924,ALUNO DE GRADUAÇÃO,1047152,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,353,Ciências sociais,CIÊNCIAS SOCIAIS
57,9405724,2014019196,2017-01-17 08:45:56.495,2017,2017-01-30 08:48:42,2012952924,ALUNO DE GRADUAÇÃO,1116367,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,139,Filosofia e psicologia,CIÊNCIAS SOCIAIS
58,9405728,2014069565,2017-01-17 08:45:56.439,2017,2017-01-30 08:48:37,2012952924,ALUNO DE GRADUAÇÃO,1165654,Acervo Circulante,Biblioteca Central Zila Mamede,REGULAR,680,Ciências aplicadas,CIÊNCIAS SOCIAIS

In [72]:
# selecionando as colunas relevantes para a análise final
df_final = df_merged_grad[['id_emprestimo', 'curso', 'data_emprestimo']]
df_final.head()

    id_emprestimo             curso  data_emprestimo
26        9405596  CIÊNCIAS SOCIAIS             2017
27        9405600  CIÊNCIAS SOCIAIS             2017
56        9405720  CIÊNCIAS SOCIAIS             2017
57        9405724  CIÊNCIAS SOCIAIS             2017
58        9405728  CIÊNCIAS SOCIAIS             2017

In [73]:
df_final.iloc[:,[1,2]].value_counts()

curso               data_emprestimo
COMUNICAÇÃO SOCIAL  2017               8253
                    2016               7973
DIREITO             2017               7885
BIBLIOTECONOMIA     2015               7784
DIREITO             2015               7665
FILOSOFIA           2016               7576
CIÊNCIAS SOCIAIS    2015               7489
PEDAGOGIA           2017               7434
FILOSOFIA           2017               7389
DIREITO             2016               7363
BIBLIOTECONOMIA     2017               7307
PEDAGOGIA           2015               7189
                    2016               7153
COMUNICAÇÃO SOCIAL  2015               7147
BIBLIOTECONOMIA     2016               7044
DIREITO             2018               7027
CIÊNCIAS SOCIAIS    2016               6978
COMUNICAÇÃO SOCIAL  2018               6953
FILOSOFIA           2015               6950
CIÊNCIAS SOCIAIS    2017               6918
PEDAGOGIA           2018               6518
BIBLIOTECONOMIA     2018               6378
FILOSOFIA           2018               6296
CIÊNCIAS SOCIAIS    2018               6181
BIBLIOTECONOMIA     2019               5889
COMUNICAÇÃO SOCIAL  2019               5885
PEDAGOGIA           2019               5869
DIREITO             2019               5861
CIÊNCIAS SOCIAIS    2019               5788
FILOSOFIA           2019               5572
DIREITO             2020                905
BIBLIOTECONOMIA     2020                900
PEDAGOGIA           2020                866
FILOSOFIA           2020                832
CIÊNCIAS SOCIAIS    2020                825
COMUNICAÇÃO SOCIAL  2020                796
Name: count, dtype: int64

In [74]:
# agrupando a quantidade de empréstimos por curso e ano
df_grouped = df_final.groupby(['curso', 'data_emprestimo'])['id_emprestimo'].count().reset_index()
df_grouped.rename(columns={'id_emprestimo':'quantidade_emprestimos'}, inplace=True)
df_grouped

                 curso  data_emprestimo  quantidade_emprestimos
0      BIBLIOTECONOMIA             2015                    7784
1      BIBLIOTECONOMIA             2016                    7044
2      BIBLIOTECONOMIA             2017                    7307
3      BIBLIOTECONOMIA             2018                    6378
4      BIBLIOTECONOMIA             2019                    5889
5      BIBLIOTECONOMIA             2020                     900
6     CIÊNCIAS SOCIAIS             2015                    7489
7     CIÊNCIAS SOCIAIS             2016                    6978
8     CIÊNCIAS SOCIAIS             2017                    6918
9     CIÊNCIAS SOCIAIS             2018                    6181
10    CIÊNCIAS SOCIAIS             2019                    5788
11    CIÊNCIAS SOCIAIS             2020                     825
12  COMUNICAÇÃO SOCIAL             2015                    7147
13  COMUNICAÇÃO SOCIAL             2016                    7973
14  COMUNICAÇÃO SOCIAL             2017                    8253
15  COMUNICAÇÃO SOCIAL             2018                    6953
16  COMUNICAÇÃO SOCIAL             2019                    5885
17  COMUNICAÇÃO SOCIAL             2020                     796
18             DIREITO             2015                    7665
19             DIREITO             2016                    7363
20             DIREITO             2017                    7885
21             DIREITO             2018                    7027
22             DIREITO             2019                    5861
23             DIREITO             2020                     905
24           FILOSOFIA             2015                    6950
25           FILOSOFIA             2016                    7576
26           FILOSOFIA             2017                    7389
27           FILOSOFIA             2018                    6296
28           FILOSOFIA             2019                    5572
29           FILOSOFIA             2020                     832
30           PEDAGOGIA             2015                    7189
31           PEDAGOGIA             2016                    7153
32           PEDAGOGIA             2017                    7434
33           PEDAGOGIA             2018                    6518
34           PEDAGOGIA             2019                    5869
35           PEDAGOGIA             2020                     866

In [80]:
# transformando ano em colunas
df_pivot = df_grouped.pivot_table(
    index='curso', 
    columns='data_emprestimo', 
    values='quantidade_emprestimos',
    #fill_value='-',
    aggfunc='sum',
    margins=True,
    margins_name='Total')
df_pivot

data_emprestimo      2015   2016   2017   2018   2019  2020   Total
curso
BIBLIOTECONOMIA      7784   7044   7307   6378   5889   900   35302
CIÊNCIAS SOCIAIS     7489   6978   6918   6181   5788   825   34179
COMUNICAÇÃO SOCIAL   7147   7973   8253   6953   5885   796   37007
DIREITO              7665   7363   7885   7027   5861   905   36706
FILOSOFIA            6950   7576   7389   6296   5572   832   34615
PEDAGOGIA            7189   7153   7434   6518   5869   866   35029
Total               44224  44087  45186  39353  34864  5124  212838